{
"file":
    "File",

"help":
    "Help",

"theme":
    "Theme",

"interface":
    "Interface",

"ini_langue":
    "Select the interface language here",

"ini_theme":
    "Choose the interface theme",

"entry_id":
    "Enter your ID here. This can be any word you like; the only condition is that you must be able to remember it in case of need, as this identifier is used by the software but is not stored in the computer. Example: your first and last names, or those of your girlfriend, or one or more words of your choice. However, there's one rule you must observe: don't use spaces; replace spaces with underscores “_” (key 8 on a PC or dedicated key on a Mac). Example: Albert_Durant. There's no need to choose a complicated word. You will only be asked for this identifier if you change computer or after a formatting operation; however, you will need it, otherwise it will no longer reproduce the passwords you use",

"entry_ini_mdp":
    "Enter your password here. As with the login above, choose a password without spaces and simple but not too simple; avoid your date of birth or “Qwerty”, use something like “Napoleon lost at Waterloo in 1815!” If you keep the first letters, you'll get\n“NlaWi1815!”, easy to remember and solid.\n Replace spaces with underscores ( _ ). Again, please note that the software does not save your password",

"mdp":
    "Here you need to retype your password to check that it matches the one you entered during initialization when you first used the software. You are allowed 3 attempts. If you have made 3 errors, the software will close and you will not be able to use it. This procedure is designed to prevent any “pirate” from accessing your computer.",

"site":
    "Click on the little arrow on the right to see the list of sites. You can also press the arrow key and enter. If the site concerned doesn't appear in the list, type it in, it will be taken into account and will appear the next time.\n As usual, don't put spaces, if necessary, replace them with underscores ( _ ).\n It can happen that the same site asks you for several passwords; let's imagine you visit the site “collection_voitures”. This site asks you for a password to register and has a forum that asks you for another password. Don't try to complicate things by copying the address; the most important thing is that you remember what you're doing. To keep the name in the list of sites, simplify it with “Collec_auto_i” and “Collec_auto_f” (for example)",


"Messagebox.show_warning":
    [
    "No help files found for this widget.",
    "Help"
    ],

"Messagebox.show_warning_2":
    [
    "LAST WARNING: This will ERASE ALL DATA. Proceed only if certain. Otherwise, click 'No' and consult an expert.",
    "WARNING",    
    "CONFIRM RESET",
    "Do you confirm the complete reset of the application?\nAll data will be lost.",
    "Confirm",
    "Cancel"
    ],

"Messagebox.show_warning_2_buttons":
    [
    {"label": "Confirm", "style": "danger"},
    {"label": "Cancel", "style": "secondary"}
    ],

    "Messagebox.show_error_1":
    [
    "This password is invalid, try again\nYou have three tries.",
    "Invalid password"
    ],

"Messagebox.show_error_2":
    [
    "Either you haven't chosen a site, or the name you typed contains one or more spaces, which is (in principle) forbidden in site names",
    "Questionable validation."
    ],

"button_valid.configure_text":
    "Click to obtain your \"strong\" password",

"label_mdp_text":
    "Please type your password",

"ToolTip_entry_mdp_text":
    "Type your password here without spaces as verification. To validate, press \"Enter\" ",

"label_site_text":
    "Please select the relevant site",

"ToolTip_combobox_site_text":
    "Click on the small arrow on the right to choose the requesting site or press the \"↓\" key. If it doesn't appear, type it in, it will be present the next time you use it.\nFor more details, type \"F1\"",

"ToolTip_button_valid_text":
    "Click here or press \"Enter\" to validate",

"label_info_sortie_text":
    "Below is your password \"strong\"\nIt's copied to the clipboard. To use it, simply go to the requesting software\nand type \"<Ctrl+v>\" or \"<right-click-paste>\"",

"button_valid_ini.configure_text":
    "Validate",

"Messagebox.show_error_3":
    [
    "You have not chosen a username or it contains spaces",
    "Invalid username"
    ],

"Messagebox.show_error_4":
    [
    "You have not chosen a password or it contains spaces",
    "Invalid password"
    ],

"ini_fen_ttk.Window_title":
    "First use: Initialize login and password",

"label_id_ttk.Label_ini_fen_text":
    "Please enter your login",

"ToolTip_entry_id_text":
    "Enter your ID here.\nValidate by pressing “Enter”\nFor more details, press “F1”.",

"label_ini_mdp_ttk.Label_ini_fen_text":
    "Please enter your password",

"ToolTip_entry_ini_mdp_text":
    "Type your password here without spaces. Validate by pressing “Enter”\nFor more details, type “F1”.",

"ToolTip_button_valid_ini_text":
    "Click here or press enter.",

"label_link_notice":
    "Instructions for use",

"ToolTip_label_link_notice":
    "If you would like to consult the complete instructions for use, click here",

"label_ini_langue":
    "Language",

"combobox_ini_langue":
    [
    "French",
    "English",
    "Spanish",
    "Romanian"
    ],

"label_ini_theme":
    "Theme",

"combobox_ini_theme":
    [
    "Clear",
    "Dark",
    "Soft",
    "blue-night"
    ],

"ToolTip_combobox_ini_langue":
    "Choose the interface language by clicking on the small arrow or by pressing the down-arrow key “↓”. Confirm by pressing the “enter” key",

"ToolTip_combobox_ini_theme":
    "Choose theme. Confirm by pressing the “enter” key",

"label_info_ini_text":
    "WARNING,\nthis initialization window only appears the first time\n you use your software.",

"Messagebox.show_question":
    [
    "You seem to have mastered Creapass.\nWould you like Creapass to open in minimized form when launched in the future?\n  If YES, you will find a menu by right-clicking on the icon next to the clock",
    "MiniInterface ?"
    ],

"Minimenu":
    [
    "Open and/or bring to the foreground",
    "Minimize",
    "Quit"
    ],

"Mdp_inimini":
    "Type your Creapass password and press \"Enter\"",

"Systray_infobule":
    "Creapass\nYour password creator",

"liste_aide":
    [
    "User Manual",
    "Video",
    "About"
    ],

"a_propos":
    [
    "About Creapass",
    "Creator of strong,\nreproducible, and secure passwords",
    "Copyright 2025 Jean Dalbrut\nexcept icon and logo, copyright 2025 Quentin Dalbrut",
    "Translations :",
    "information",
    "contact",
    "close"
    ]
}
