{
"file":
    "Fichier",

"help":
    "Aide",

"theme":
    "Thème",

"interface":
    "Interface",

"ini_langue":
    "Choisissez votre langue",

"ini_theme":
    "Coisissez le thème de l'interface",

"entry_id" :
    "Entrez ici votre identifiant. Celui-ci peut être n’importe quel mot de votre choix ; la seule condition est que vous puissiez vous en souvenir en cas de besoin, en effet,cet identifiant est utilisé par le logiciel mais n'est pas stocké dans l'ordinateur . Exemple, vos nom et prénoms, ou ceux de votre petite amie, ou un ou plusieurs mots quelconques.\nIl faut cependant respecter une règle, ne pas mettre d’espace ; remplacer les espaces par des underscores « _ »(touche 8 d’un PC ou touche dédiée sur un Mac). Exemple, Albert_Durant. Il est inutile de choisir un mot compliqué. Cet identifiant ne vous sera demandé que si vous changez d'ordinateur ou suite à un formatage ; cependant, il vous sera indispensable, sans quoi il ne reproduira plus les mots de passe que vous utilisez",

"entry_ini_mdp" :
    "Entrez ici votre mot de passe. Comme pour l’identifiant ci- dessus, choisissez un mot de passe sans espace et simple mais pas trop ; évitez votre date de naissance ou \"Azerty\", utilisez plutôt un truc du genre :\n« Le 18 juin 40 Charles de Gaulle appelle les français à la résistance! »\n. Prenez les premières lettres de chaque mot, vous obtenez\n \" L18j40CdGalfàlr! \", facile à retenir et solide.\n Autre exemple : « Ma grand-mère est née le 15 décembre 50! »\ndevient  \"Mg-menl15d50!\"\nRemplacez les espaces par des underscores ( _ ). Là encore, sachez que le logiciel n’enregistre pas votre mot de passe.",

"mdp" :
    "Vous devez ici retaper votre mot de passe afin de vérifier qu'il correspond à celui que vous avez entré lors de l'initialisation au cours de la première utilisation du logiciel. Vous avez droit à 3 essais. Si vous avez commis 3 erreurs, le logiciel se ferme et vous ne pouvez pas l'utiliser. Cette procédure vise à interdire l'usage à un éventuel \"pirate\" qui aurait accès à votre ordinateur.",

"site":
    "Clic sur la petite flèche à droite pour avoir la liste des sites. Vous pouvez aussi appuyer sur la touche \"flèche-bas\" puis entrée. Si le site concerné ne figure pas dans la liste, tapez-le, il sera pris en compte et il apparaîtra la prochaine fois.\n Comme d'habitude, ne mettez pas d'espaces, si besoin, remplacez les par des underscores ( _ ).\n Il peut arriver qu'un même site vous demande plusieurs mots de passe ; imaginons que vous visitiez le site «collection_voitures». Ce site vous demande un mot de passe pour votre inscription et dispose d'un forum qui vous demande un autre mot de passe. Ne cherchez pas la complication en recopiant l'adresse ; l'essentiel est que vous vous souveniez de ce que vous faites. Afin que le nom loge dans la liste des sites, simplifiez par «Collec_auto_i» et «Collec_auto_f» (par exemple).",


"Messagebox.show_warning":
    [
    "Aucun fichier d'aide trouvé pour ce widget.",
    "Aide"
    ],

"Messagebox.show_warning_2":
    [
    "Êtes-vous VRAIMENT sûr de vouloir réinitialiser totalement le logiciel ?\nToutes vos données seront perdues.\nSi vous n'êtes pas sûr de vous, appuyez sur \"Non\" et demandez de l'aide à un professionnel.",
    "DANGER"
    ],

"Messagebox.show_error_1":
    [
    "Ce mot de passe n'est pas valide, recommencez\nVous avez trois essais.",
    "Mot de passe invalide"
    ],

"Messagebox.show_error_2":
    [
    "Soit vous n'avez pas choisi de site, soit le nom tapé contient un ou plusieurs espaces, ce qui est (en principe) interdit dans les noms de site",
    "Validation douteuse"
    ],

"button_valid.configure_text":
    "Cliquez pour obtenir votre mot de passe « solide »",

"label_mdp_text":
    "Veuillez taper votre mot de passe",

"ToolTip_entry_mdp_text":
    "Tapez ici votre mot de passe sans espace à titre de vérification\nPour valider, appuyez sur «Entrée» ",

"label_site_text":
    "Veuillez choisir le site ou l'app concerné",

"ToolTip_combobox_site_text":
    "Cliquez sur la petite flèche à droite pour choisir le site demandeur ou appuyez sur la touche « ↓ ». S'il ne figure pas, tapez le, il sera présent lors de la prochaine utilisation.\nPour plus de détails, appuyez sur « F1 »",

"ToolTip_button_valid_text":
    "Cliquez ici ou appuyez sur *«Entrée» pour valider",

"label_info_sortie_text":
    "Ci-dessous votre mot de passe « solide »\nIl est copié dans le presse papier. Pour l'utiliser, il vous suffit de vous rendre dans le\nlogiciel demandeur et taper \"<Ctrl+v>\" ou \"<clic droit-coller>\"",

"button_valid_ini.configure_text":
    "Valider",

"Messagebox.show_error_3":
    [
    "Vous n'avez pas choisi d'identifiant ou celui-ci contient des espaces.",
    "Identifiant invalide"
    ],

"Messagebox.show_error_4":
    [
    "Vous n'avez pas choisi de mot de passe ou celui-ci contient des espaces.",
    "Mot de passe invalide"
    ],

"ini_fen_ttk.Window_title":
    "Première utilisation : Initialisation identifiant et mot de passe",

"label_id_ttk.Label_ini_fen_text":
    "Veuillez saisir votre identifiant",

"ToolTip_entry_id_text":
    "Saisissez ici votre identifiant.\nValidez en appuyant sur «Entrée»\nPour plus de détails, appuyez sur « F1 ».",

"label_ini_mdp_ttk.Label_ini_fen_text":
    "Veuillez entrer votre mot de passe",

"ToolTip_entry_ini_mdp_text":
    "Tapez ici votre mot de passe sans espace. Validez en appuyant sur «Entrée»\nPour plus de détails, tapez « F1 ».",

"ToolTip_button_valid_ini_text":
    "Cliquez ici ou appuyez sur entrée",

"label_link_notice":
    "Notice d'emploi",

"ToolTip_label_link_notice":
    "Si vous désirez consulter la notice d'emploi globale, cliquez ici",

"label_ini_langue":
    "Langue",

"combobox_ini_langue":
    [
    "Français",
    "Anglais",
    "Espagnol",
    "Roumain"
    ],
"label_ini_theme":
    "Thème",

"combobox_ini_theme":
    [
    "Clair",
    "Foncé",
    "Doux",
    "Bleu-nuit"
    ],

"ToolTip_combobox_ini_langue":
    "Choisissez la langue de l'interface en cliquant sur la petite flèche ou en appuyant sur la touche flèche-bas « ↓ ». Validez en appuyant sur la touche « entrée »",

"ToolTip_combobox_ini_theme":
    "Choisissez le thème. Validez en appuyant sur la touche « entrée »",

"label_info_ini_text":
    "ATTENTION, \nCette fenêtre d'initialisation n'apparait que lors de\n la première utilisation de votre logiciel.",

"Messagebox.show_question":
    [
    "Vous semblez maîtriser Creapass.\n Désirez vous qu'à l'avenir Creapass s'ouvre dès le lancement, sous sa forme minimisée ?\n  Si OUI, vous trouverez un menu en cliquant (clic droit) sur l'icône prés de l'horloge",
    "MiniInterface ?"
    ],

"Minimenu":
    [
    "Ouvrir et/ou mettre au premier plan",
    "Réduire",
    "Quitter"
    ],

"Mdp_inimini":
    "Tapez votre mot de passe Creapass et appuyez sur \"Entrée\"",

"Systray_infobule":
    "Creapass\nVotre créateur de mots de passe",

"liste_aide":
    [
    "Notice d'emploi",
    "Vidéo",
    "À propos"
    ],

"a_propos":
    [
    "À propos de Creapass",
    "Créateur de mots de passe\nsolides, reproductibles et sécurisés",
    "Copyright 2025 Jean Dalbrut\nsauf icône et logo, copyright 2025 Quentin Dalbrut",
    "Traductions :",
    "information",
    "contact",
    "fermer"
    ]

}
